m/crystal/src/org/uni_notes/analyse1.org
#+title: Analyse 1
#+AUTHOR: Crystal
#+OPTIONS: ^:{}
#+OPTIONS: num:nil
#+EXPORT_FILE_NAME: ../../../uni_notes/analyse.html
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="../src/css/colors.css"/>
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="../src/css/style.css"/>
#+HTML_LINK_HOME: https://crystal.tilde.institute/
#+HTML_LINK_UP: ../../../uni_notes/
#+OPTIONS: html-style:nil
#+OPTIONS: toc:4
#+HTML_HEAD: <link rel="icon" type="image/x-icon" href="https://crystal.tilde.institute/favicon.png">
#+OPTIONS: \n:y
* Contenu de la Matiére
** Chapitre 1 : Quelque propriétés de ℝ
- Structure algébrique de ℝ
- L'ordre dans ℝ
- Majorant, minorant, borne superieure, borne inférieure

** Chapitre 2 : Les suites numériques réelles
- Définition : convergence, opérations sur les suites convergentes
- Theoréme de convergence, Theoréme de ___ suites, sans suites, extension au limites infinies
- Suites de cauchy, suites adjacentes et suites récurentes

** Chapitre 3 : Limites et continuité des fonctions réelles d'une variable réelle
- Les limites : définition, opérations sur les limites, les formes inditerminées
- La continuité : définition, Theorémes fondamentaux
- La continuité informe les fonctions Lepchitziennes

** Chapitre 4 : La dérivabilité et son interprétation géometrique
- Opérations sur les fonctions dérivales, Theoréme de Rolle, Theoréme des accroissements finis, régle de L'Hopital et formule de Taylor

** Chapitre 5 : Les fonctions trigonométriques réciproques, fonctions hypérboliques réciproques
- Comparaison asymptotique
- Symbole de lamdau (lambda ?), et notions des fonctions équivalentes
- Développements limites polynominaux (D.L) et opérations sur les D.L
- Généralisations des D.L
- Application au calcul de limite et l'étude des branches infinies


* Premier cours : Quelque propriétés de ℝ /Sep 26/ :

** La loi de composition interne dans E :
@ : E x E ---> E
    (x,y) ---> x @ y

@ est une lois de composition interne seulement si :

*∀ x,y ε E*


*** *Example : Addition*
Est ce que l'addition (+) est L.C.I dans ℕ  ?

ℕ x ℕ ---> ℕ

(x,y) ---> x + y ? /En gros : Pour que l'addition soit une L.C.I dans ℕ, il faut que: quand on additionne *n'importe quel* chiffre x et y de N, il faut que le résultat appertiens aussi a ℕ/

∀ x,y ∈ ℕ , x + y ∈ ℕ /En gros: Pour TOUTE valeur de x et y appartenant a ℕ, leur somme est toujours dans ℕ/

Donc : + est L.C.I dans ℕ

*** *Example : soustraction*
Est ce que la soustraction (-) est L.C.I dans ℕ?

ℕ x ℕ ---> ℕ

(x,y) ---> x - y ?


∃ x , y ∈ ℕ , x - y ∉ ℕ /En gros: il existe au moins une valeur de x et y dans ℕ tel que leur différence n'est *PAS* dans ℕ . tel que : si x est 5, et y c'est 9. Leur différence est -4, qui appartiens pas a ℕ/

** La loi de composition externe dans E :

@ est L.C.E dans E, K est un corps

K x E ---> E

(a,x) ---> a @ x

∀ (a , x) ∈ K x E , a @ x ∈ E

** Groupes :
/Soit E un ensemble, soit @ une L.C.I dans E/

(E, @) est un groupe Si :

*** Il contiens un élement neutre

∀ x ∈ E ; ∃ e ∈ E

x @ e = e @ x = x

On appelle *e* élement neutre

/Ex: (ℕ,+) accepte un élement neutre, qui est 0, parceque x + 0 = 0 + x = x....cependent (ℕ,+) n'est pas un groupe. La raison est dans la prochaine condition/

