m/crystal/uni_notes/analyse.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-11-14 Tue 23:06 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Analyse 1</title>
<meta name="author" content="Crystal" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../src/css/colors.css"/>
<link rel="stylesheet" type="text/css" href="../src/css/style.css"/>
<link rel="icon" type="image/x-icon" href="https://crystal.tilde.institute/favicon.png">
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../../../uni_notes/"> UP </a>
 |
 <a accesskey="H" href="https://crystal.tilde.institute/"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">Analyse 1</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org51375f0">Contenu de la Matiére</a>
<ul>
<li><a href="#orgd074219">Chapitre 1 : Quelque propriétés de ℝ</a></li>
<li><a href="#orgb5220df">Chapitre 2 : Les suites numériques réelles</a></li>
<li><a href="#orge7b80f9">Chapitre 3 : Limites et continuité des fonctions réelles d&rsquo;une variable réelle</a></li>
<li><a href="#orgcc6964b">Chapitre 4 : La dérivabilité et son interprétation géometrique</a></li>
<li><a href="#orgea870f0">Chapitre 5 : Les fonctions trigonométriques réciproques, fonctions hypérboliques réciproques</a></li>
</ul>
</li>
<li><a href="#org7dbe2a4">Premier cours : Quelque propriétés de ℝ <i>Sep 26</i> :</a>
<ul>
<li><a href="#org4b25f0c">La loi de composition interne dans E :</a>
<ul>
<li><a href="#orgc048164"><b>Example : Addition</b></a></li>
<li><a href="#orgadeeaa1"><b>Example : soustraction</b></a></li>
</ul>
</li>
<li><a href="#orge686f2a">La loi de composition externe dans E :</a></li>
<li><a href="#org96fc192">Groupes :</a>
<ul>
<li><a href="#org9cae959">Il contiens un élement neutre</a></li>
<li><a href="#orgfc1fc7b">Il contiens un élément symétrique</a></li>
<li><a href="#orge76674f">@ est cummutative :</a></li>
</ul>
</li>
<li><a href="#orgde40808">Anneaux :</a>
<ul>
<li><a href="#org6960733">(E ; @) est un groupe cummutatif</a></li>
<li><a href="#org3dd13c2">! est une loi associative :</a></li>
<li><a href="#org96e7790">Distribution de ! par rapport à @ :</a></li>
<li><a href="#orgaaceb67">L&rsquo;existance d&rsquo;un élèment neutre de ! :</a></li>
<li><a href="#org07575e5">! est cummutative :</a></li>
</ul>
</li>
<li><a href="#org4dde6a2">Corps :</a>
<ul>
<li><a href="#orga3ea966">La symétrie :</a></li>
</ul>
</li>
<li><a href="#org316172f">Exercice : (ℝ, +, x) corps ou pas ?</a>
<ul>
<li><a href="#org4ed9aef">Est-ce un Anneau ?</a></li>
<li><a href="#org248a5ea">Est-ce un corps ?</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org0b3fce2">2nd cours :L&rsquo;ordre dans ℝ, Majorant, minorant, borne superieure, borne inférieure <i>Oct 3</i> :</a>
<ul>
<li><a href="#orga3c4b3c">L&rsquo;ordre dans ℝ</a>
<ul>
<li><a href="#org9b04907">Exemples :</a></li>
</ul>
</li>
<li><a href="#org824efff">Majorant, minorant, borne supérieure, borne inférieure</a>
<ul>
<li><a href="#org34c228b">Majorant:</a></li>
<li><a href="#orgc832fb0">Minorant:</a></li>
<li><a href="#org3cb02e2">Borne supérieure:</a></li>
<li><a href="#orgef4458e">Borne inférieure:</a></li>
<li><a href="#org2b2908f">Maximum :</a></li>
<li><a href="#org1410a06">Minimum :</a></li>
<li><a href="#orgd1fcd4e">Remarques :</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgc939931">3rd cours :Les suites numériques <i>Oct 5</i> :</a>
<ul>
<li>
<ul>
<li><a href="#org8607984">Définition :</a></li>
<li><a href="#orgcc2100f">Définition N°2 :</a></li>
</ul>
</li>
<li><a href="#org69f8c52">Opérations sur les suites :</a>
<ul>
<li><a href="#orgf01d039">La somme :</a></li>
<li><a href="#org770eaba">Le produit :</a></li>
<li><a href="#org7a41073">Inverse d&rsquo;une suite :</a></li>
<li><a href="#orgd245f39">Produit d&rsquo;une suite par un scalaire :</a></li>
</ul>
</li>
<li><a href="#orgd7a311f">Suite bornée :</a></li>
<li><a href="#org2b180d2">Suite majorée :</a></li>
<li><a href="#org7b2e23f">Suite minorée :</a></li>
<li><a href="#orgb167fb6">Suites monotones :</a>
<ul>
<li><a href="#org28ff308">Les suites croissantes :</a></li>
<li><a href="#org89d3d3b">Les suites décroissantes :</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org65657c4">Série TD N°1 : <i>Oct 6</i></a>
<ul>
<li><a href="#orgac13612">Exo 1 :</a>
<ul>
<li><a href="#orgcb1b828">Ensemble A :</a></li>
<li><a href="#org886db21">Ensemble B :</a></li>
<li><a href="#org8444304">Ensemble C :</a></li>
<li><a href="#org655bbdc">Ensemble D :</a></li>
<li><a href="#orgf122a29">Ensemble E :</a></li>
</ul>
</li>
<li><a href="#org5e26290">Exo 2 :</a>
<ul>
<li><a href="#org62a0c2c">Ensemble A :</a></li>
<li><a href="#orgdde4c67">Ensemble B :</a></li>
<li><a href="#org2abc744">Ensemble C :</a></li>
<li><a href="#orga2cb085">Ensemble D :</a></li>
<li><a href="#orgc6452f9">Ensemble E :</a></li>
</ul>
</li>
<li><a href="#org479db70">Exo 3 :</a>
<ul>
<li><a href="#org9f28f97">Question 1 :</a></li>
<li><a href="#orgb2a312c">Question 2 :</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgbd1bb1e">4th cours (Suite) : <i>Oct 10</i></a>
<ul>
<li><a href="#org9b40096">Les suites convergentes</a>
<ul>
<li><a href="#org6a22c62">Remarque :</a></li>
</ul>
</li>
<li><a href="#orga3baa03">Theoreme d&rsquo;encadrement</a></li>
<li><a href="#orgbbda563">Suites arithmetiques</a>
<ul>
<li><a href="#orgb4756c6">Forme general</a></li>
<li><a href="#orga6494e4">Somme des n premiers termes</a></li>
</ul>
</li>
<li><a href="#org10d88d9">Suites géométriques</a>
<ul>
<li><a href="#orgfe286ce">Forme general</a></li>
<li><a href="#orgaa6b262">Somme des n premiers termes</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgeeb4832">5th cours (suite) : <i>Oct 12</i></a>
<ul>
<li><a href="#orge9160fd">Suites adjacentes:</a></li>
<li><a href="#orgaedf3ea">Suites extraites (sous-suites):</a>
<ul>
<li><a href="#org586e8c4">Remarques:</a></li>
</ul>
</li>
<li><a href="#org1ce447c">Suites de Cauchy:</a>
<ul>
<li><a href="#orgd06f7ae">Remarque :</a></li>
</ul>
</li>
<li><a href="#org392a346">Théorème de Bolzano Weirstrass:</a></li>
</ul>
</li>
<li><a href="#org91a748f">Chapitre 3 : Les limites et la continuité <i>Nov 14</i></a>
<ul>
<li><a href="#orgde4196b">Fonction réelle à variable réelle :</a>
<ul>
<li><a href="#orgd68331d">L&rsquo;ensemble de départ :</a></li>
<li><a href="#org3151412">Les Limites :</a></li>
<li><a href="#org287d826">La continuité :</a></li>
<li><a href="#orgc77ab14">Prolongement par continuité :</a></li>
<li><a href="#org8edfe47">Théorème des valeurs intermédiaires :</a></li>
<li><a href="#orgea41b1c">Fonction croissante :</a></li>
<li><a href="#orgd45a9b4">Injection = Strictement monotonne :</a></li>
<li><a href="#org189c903">Surjection = Continuité :</a></li>
<li><a href="#org07713a2">Bijection :</a></li>
<li><a href="#org7512d26">Théorème de bijection :</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org51375f0" class="outline-2">
<h2 id="org51375f0">Contenu de la Matiére</h2>
<div class="outline-text-2" id="text-org51375f0">
</div>
<div id="outline-container-orgd074219" class="outline-3">
<h3 id="orgd074219">Chapitre 1 : Quelque propriétés de ℝ</h3>
<div class="outline-text-3" id="text-orgd074219">
<ul class="org-ul">
<li>Structure algébrique de ℝ<br /></li>
<li>L&rsquo;ordre dans ℝ<br /></li>
<li>Majorant, minorant, borne superieure, borne inférieure<br /></li>
</ul>
</div>
</div>
<div id="outline-container-orgb5220df" class="outline-3">
<h3 id="orgb5220df">Chapitre 2 : Les suites numériques réelles</h3>
<div class="outline-text-3" id="text-orgb5220df">
<ul class="org-ul">
<li>Définition : convergence, opérations sur les suites convergentes<br /></li>
<li>Theoréme de convergence, Theoréme de <span class="underline">_</span> suites, sans suites, extension au limites infinies<br /></li>
<li>Suites de cauchy, suites adjacentes et suites récurentes<br /></li>
</ul>
</div>
</div>
<div id="outline-container-orge7b80f9" class="outline-3">
<h3 id="orge7b80f9">Chapitre 3 : Limites et continuité des fonctions réelles d&rsquo;une variable réelle</h3>
<div class="outline-text-3" id="text-orge7b80f9">
<ul class="org-ul">
<li>Les limites : définition, opérations sur les limites, les formes inditerminées<br /></li>
<li>La continuité : définition, Theorémes fondamentaux<br /></li>
<li>La continuité informe les fonctions Lepchitziennes<br /></li>
</ul>
</div>
</div>
<div id="outline-container-orgcc6964b" class="outline-3">
<h3 id="orgcc6964b">Chapitre 4 : La dérivabilité et son interprétation géometrique</h3>
<div class="outline-text-3" id="text-orgcc6964b">
<ul class="org-ul">
<li>Opérations sur les fonctions dérivales, Theoréme de Rolle, Theoréme des accroissements finis, régle de L&rsquo;Hopital et formule de Taylor<br /></li>
</ul>
</div>
</div>
<div id="outline-container-orgea870f0" class="outline-3">
<h3 id="orgea870f0">Chapitre 5 : Les fonctions trigonométriques réciproques, fonctions hypérboliques réciproques</h3>
<div class="outline-text-3" id="text-orgea870f0">
<ul class="org-ul">
<li>Comparaison asymptotique<br /></li>
<li>Symbole de lamdau (lambda ?), et notions des fonctions équivalentes<br /></li>
<li>Développements limites polynominaux (D.L) et opérations sur les D.L<br /></li>
<li>Généralisations des D.L<br /></li>
<li>Application au calcul de limite et l&rsquo;étude des branches infinies<br /></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org7dbe2a4" class="outline-2">
<h2 id="org7dbe2a4">Premier cours : Quelque propriétés de ℝ <i>Sep 26</i> :</h2>
<div class="outline-text-2" id="text-org7dbe2a4">
</div>
<div id="outline-container-org4b25f0c" class="outline-3">
<h3 id="org4b25f0c">La loi de composition interne dans E :</h3>
<div class="outline-text-3" id="text-org4b25f0c">
<p>
@ : E x E &#x2014;&gt; E<br />
    (x,y) &#x2014;&gt; x @ y<br />
</p>

<p>
@ est une lois de composition interne seulement si :<br />
</p>

<p>
<b>∀ x,y ε E</b><br />
</p>
</div>
<div id="outline-container-orgc048164" class="outline-4">
<h4 id="orgc048164"><b>Example : Addition</b></h4>
<div class="outline-text-4" id="text-orgc048164">
<p>
Est ce que l&rsquo;addition (+) est L.C.I dans ℕ  ?<br />
</p>

<p>
ℕ x ℕ &#x2014;&gt; ℕ<br />
</p>

<p>
(x,y) &#x2014;&gt; x + y ? <i>En gros : Pour que l&rsquo;addition soit une L.C.I dans ℕ, il faut que: quand on additionne <b>n&rsquo;importe quel</b> chiffre x et y de N, il faut que le résultat appertiens aussi a ℕ</i><br />
</p>

<p>
∀ x,y ∈ ℕ , x + y ∈ ℕ <i>En gros: Pour TOUTE valeur de x et y appartenant a ℕ, leur somme est toujours dans ℕ</i><br />
</p>

<p>
Donc : + est L.C.I dans ℕ<br />
</p>
</div>
</div>
<div id="outline-container-orgadeeaa1" class="outline-4">
<h4 id="orgadeeaa1"><b>Example : soustraction</b></h4>
<div class="outline-text-4" id="text-orgadeeaa1">
<p>
Est ce que la soustraction (-) est L.C.I dans ℕ?<br />
</p>

<p>
ℕ x ℕ &#x2014;&gt; ℕ<br />
</p>

<p>
(x,y) &#x2014;&gt; x - y ?<br />
</p>


<p>
∃ x , y ∈ ℕ , x - y ∉ ℕ <i>En gros: il existe au moins une valeur de x et y dans ℕ tel que leur différence n&rsquo;est <b>PAS</b> dans ℕ . tel que : si x est 5, et y c&rsquo;est 9. Leur différence est -4, qui appartiens pas a ℕ</i><br />
</p>
</div>
</div>
</div>
<div id="outline-container-orge686f2a" class="outline-3">
<h3 id="orge686f2a">La loi de composition externe dans E :</h3>
<div class="outline-text-3" id="text-orge686f2a">
<p>
@ est L.C.E dans E, K est un corps<br />
</p>

<p>
K x E &#x2014;&gt; E<br />
</p>

<p>
(a,x) &#x2014;&gt; a @ x<br />
</p>

<p>
∀ (a , x) ∈ K x E , a @ x ∈ E<br />
</p>
</div>
</div>
<div id="outline-container-org96fc192" class="outline-3">
<h3 id="org96fc192">Groupes :</h3>
<div class="outline-text-3" id="text-org96fc192">
<p>
<i>Soit E un ensemble, soit @ une L.C.I dans E</i><br />
</p>

<p>
(E, @) est un groupe Si :<br />
</p>
</div>
<div id="outline-container-org9cae959" class="outline-4">
<h4 id="org9cae959">Il contiens un élement neutre</h4>
<div class="outline-text-4" id="text-org9cae959">
<p>
∀ x ∈ E ; ∃ e ∈ E<br />
</p>

<p>
x @ e = e @ x = x<br />
</p>

<p>
On appelle <b>e</b> élement neutre<br />
</p>

<p>
<i>Ex: (ℕ,+) accepte un élement neutre, qui est 0, parceque x + 0 = 0 + x = x&#x2026;.cependent (ℕ,+) n&rsquo;est pas un groupe. La raison est dans la prochaine condition</i><br />
</p>
</div>
</div>
