m/crystal/src/org/uni_notes/analyse1.org
*** Il contiens un élément symétrique

∀ x ∈ E ; ∃ x' ∈ E ; x @ x' = x' @ x = e

On appelle *x'* élèment symétrique

/Dans l'example en haut, on remarque qu'il n'y ya pas de chiffre x' pour chaque chiffre x, qui est, l'hors de leur addition est egal a e (0), tout simplement car:/

/x + x' = e ; x + x' = 0 ; x = -x'/

*Or, Dans ℕ, on a pas de nombres négatifs*

*** @ est cummutative :

∀ (x , x') ∈ E x E ; x @ x' = x' @ x

/L'addition est cummutative, la soustraction ne l'es pas. 5 + 3 ou 3 + 5 est pareil, mais 5 - 3 et 3 - 5 sont différents/

** Anneaux :
Soit E un ensemble, (E , @ , !) est un anneau si :
*** (E ; @) est un groupe cummutatif
*** ! est une loi associative :
∀ x , y , z ∈ E

(x ! y) ! z = x ! (y ! z)
*** Distribution de ! par rapport à @ :
∀ x , y , z ∈ E

(x @ y) ! z = ( x ! z ) @ ( y ! z )
*** L'existance d'un élèment neutre de ! :

∀ x ∈ E , ∃ e ∈ E , x ! e = e ! x = x

*** ! est cummutative :

∀ x , y ∈ E , x ! y = y ! x

** Corps :
(E , @ , !) est un corps si les 5 conditions en haut sont vérifiées + cette condition :

*** La symétrie :

∀ x ∈ E ; ∃ x' ∈ E , x ! x' = x' ! x = e

x' est l'élément symétrique de x par rapport à !
(sauf élément neutre première lois )


** Exercice : (ℝ, +, x) corps ou pas ?
*** Est-ce un Anneau ?
- (ℝ, +) est un groupe commutatif
- x est une loi associative : (a x b) x c = a x (b x c)
- On peut distribuer x par rapport a + : (a + b) x c = (a x c) + (b x c)
- Il existe un élément neutre de x which is 1 : a x 1 = 1 x a = a
- La multiplication est commutative : a x b = b x a

Oui c'est un anneau
*** Est-ce un corps ?
- Oui : ∀ x ∈ ℝ\{e} ; x * x' = 1


* 2nd cours :L'ordre dans ℝ, Majorant, minorant, borne superieure, borne inférieure /Oct 3/ :
** L'ordre dans ℝ
(ℝ, +, x) est un corps, Soit R une relation d'ordre dans ℝ si :

1. R est antisymétrique :

   ∀ x, y ℝ  ; (x R y et y R x) ⇒ (x = y)

2. R est reflexive :

  ∀ x ∈ ℝ ; x R x

3. R est transitive :
  ∀ x, y, z ∈ ℝ , (x R y and y R z) ⇒ x R z

*** Exemples :
**** Exemple numéro 1:
(ℝ , +, x) est un corps. Est ce la relation < est une relation d'ordre dans ℝ ?


Non, pourquoi ? parce que elle est pas réflexive : ∀ x ∈ ℝ, x < x **is obviously false**
**** Exemple numéro 2:
(ℝ , +, x) est un corps. Est ce la relation ≥ est une relation d'ordre dans ℝ ?

1. (Antisymétrique) ∀ x, y ℝ ; (x ≥ y AND y ≥ x) ⇒ x = y  is true
2. (Réflexive) ∀ x, y ℝ ; x ≥ x is true
3. (Transitive) ∀ x, y, z ℝ ; (x ≥ y AND y ≥ z) ⇒ x ≥ z is also true

** Majorant, minorant, borne supérieure, borne inférieure
*** Majorant:
Soit E un sous-ensemble de ℝ (E ⊆ ℝ)


Soit a ∈ ℝ, a est un majorant de E Si :∀ x ∈ E , x ≤ a

*** Minorant:
Soit E un sous-ensemble de ℝ (E ⊆ ℝ)


Soit b ∈ ℝ, b est un minorant de E Si :∀ x ∈ E , x ≥ b


*** Borne supérieure:
La borne supérieure est le plus petit des majorants /Sup(E) = Borne supérieure/

*** Borne inférieure:
La borne inférieure est le plus grand des minorant /Inf (E) = Borne inférieure/

*** Maximum :
E ⊆ ℝ, a est un maximum de E (Max(E)) Si : a ∈ E ; ∀x ∈ E, x ≤ a.
*** Minimum :
E ⊆ ℝ, b est un minimum de E (Min(E)) Si : b ∈ E ; ∀x ∈ E, x ≥ b.

*** Remarques :
A et B deux ensembles bornés (Minoré et Majoré) :
1. A ∪ B est borné
2. A ∩ B est borné
3. Sup(A ∪ B)= Max(sup A, sup B)
4. Inf (A ∩ B)= Min(inf A, inf B)
5. Sup(A ∩ B)= Min(sup A, sup B) /Le plus petit des Supérieur de A et B/
6. Inf (A ∩ B)= Max(inf A, inf B) /Le plus grand des inférieur de A et B/

* 3rd cours :Les suites numériques /Oct 5/ :
*** Définition :
Soit (Un)n ∈ ℕ une suite numérique , (Un)n est une application de ℕ dans ℝ:


ℕ ----> ℝ


n ----> U(n) = Un

1. (Un) ou (Un)n ∈ ℝ : une suite
2. Un : terme général

***** Exemple :
U : ℕ* ----> ℝ


    n  ----> 1/n


    (Un) est une suite définit par Un = 1/n

*** Définition N°2 :
On peut définir une suite â partir d'une relation de récurrence entre deux termes successifs et le premier terme.
***** Exemple :
U(n+1) = Un /2


U(1)= 1
** Opérations sur les suites :
*** La somme :
Soient (Un) et (Vn) deux suites, la somme de (Un) et (Vn) est une suite de terme général Un + Vn
*** Le produit :
Soient (Un)n et (Vn)n deux suites alors (Un) x (Vn) est une autre suite de terme général Un x Vn
*** Inverse d'une suite :
Soit Un une suite de terme général Un alors l'inverse de (Un) est une autre suite (Vn) = 1/(Un) de terme général de Vn = 1/Un
*** Produit d'une suite par un scalaire :
Soit (Un) une suite de T.G Un


∀ λ ∈ ℝ , λ(Un) n ∈ ℕ est une suite de T.G Vn= λUn

** Suite bornée :
Une suite (Un) est bornée si (Un) majorée et minorée
** Suite majorée :
Soit (Un) une suite


U : (Un) est majorée par M ∈ ℝ ; ∀ n ∈ ℕ ; ∃ M ∈ ℝ , Un ≤ M

