m/crystal/uni_notes/analyse.html
<div id="outline-container-orgfc1fc7b" class="outline-4">
<h4 id="orgfc1fc7b">Il contiens un élément symétrique</h4>
<div class="outline-text-4" id="text-orgfc1fc7b">
<p>
∀ x ∈ E ; ∃ x&rsquo; ∈ E ; x @ x&rsquo; = x&rsquo; @ x = e<br />
</p>

<p>
On appelle <b>x&rsquo;</b> élèment symétrique<br />
</p>

<p>
<i>Dans l&rsquo;example en haut, on remarque qu&rsquo;il n&rsquo;y ya pas de chiffre x&rsquo; pour chaque chiffre x, qui est, l&rsquo;hors de leur addition est egal a e (0), tout simplement car:</i><br />
</p>

<p>
<i>x + x&rsquo; = e ; x + x&rsquo; = 0 ; x = -x&rsquo;</i><br />
</p>

<p>
<b>Or, Dans ℕ, on a pas de nombres négatifs</b><br />
</p>
</div>
</div>
<div id="outline-container-orge76674f" class="outline-4">
<h4 id="orge76674f">@ est cummutative :</h4>
<div class="outline-text-4" id="text-orge76674f">
<p>
∀ (x , x&rsquo;) ∈ E x E ; x @ x&rsquo; = x&rsquo; @ x<br />
</p>

<p>
<i>L&rsquo;addition est cummutative, la soustraction ne l&rsquo;es pas. 5 + 3 ou 3 + 5 est pareil, mais 5 - 3 et 3 - 5 sont différents</i><br />
</p>
</div>
</div>
</div>
<div id="outline-container-orgde40808" class="outline-3">
<h3 id="orgde40808">Anneaux :</h3>
<div class="outline-text-3" id="text-orgde40808">
<p>
Soit E un ensemble, (E , @ , !) est un anneau si :<br />
</p>
</div>
<div id="outline-container-org6960733" class="outline-4">
<h4 id="org6960733">(E ; @) est un groupe cummutatif</h4>
</div>
<div id="outline-container-org3dd13c2" class="outline-4">
<h4 id="org3dd13c2">! est une loi associative :</h4>
<div class="outline-text-4" id="text-org3dd13c2">
<p>
∀ x , y , z ∈ E<br />
</p>

<p>
(x ! y) ! z = x ! (y ! z)<br />
</p>
</div>
</div>
<div id="outline-container-org96e7790" class="outline-4">
<h4 id="org96e7790">Distribution de ! par rapport à @ :</h4>
<div class="outline-text-4" id="text-org96e7790">
<p>
∀ x , y , z ∈ E<br />
</p>

<p>
(x @ y) ! z = ( x ! z ) @ ( y ! z )<br />
</p>
</div>
</div>
<div id="outline-container-orgaaceb67" class="outline-4">
<h4 id="orgaaceb67">L&rsquo;existance d&rsquo;un élèment neutre de ! :</h4>
<div class="outline-text-4" id="text-orgaaceb67">
<p>
∀ x ∈ E , ∃ e ∈ E , x ! e = e ! x = x<br />
</p>
</div>
</div>
<div id="outline-container-org07575e5" class="outline-4">
<h4 id="org07575e5">! est cummutative :</h4>
<div class="outline-text-4" id="text-org07575e5">
<p>
∀ x , y ∈ E , x ! y = y ! x<br />
</p>
</div>
</div>
</div>
<div id="outline-container-org4dde6a2" class="outline-3">
<h3 id="org4dde6a2">Corps :</h3>
<div class="outline-text-3" id="text-org4dde6a2">
<p>
(E , @ , !) est un corps si les 5 conditions en haut sont vérifiées + cette condition :<br />
</p>
</div>
<div id="outline-container-orga3ea966" class="outline-4">
<h4 id="orga3ea966">La symétrie :</h4>
<div class="outline-text-4" id="text-orga3ea966">
<p>
∀ x ∈ E ; ∃ x&rsquo; ∈ E , x ! x&rsquo; = x&rsquo; ! x = e<br />
</p>

<p>
x&rsquo; est l&rsquo;élément symétrique de x par rapport à !<br />
(sauf élément neutre première lois )<br />
</p>
</div>
</div>
</div>
<div id="outline-container-org316172f" class="outline-3">
<h3 id="org316172f">Exercice : (ℝ, +, x) corps ou pas ?</h3>
<div class="outline-text-3" id="text-org316172f">
</div>
<div id="outline-container-org4ed9aef" class="outline-4">
<h4 id="org4ed9aef">Est-ce un Anneau ?</h4>
<div class="outline-text-4" id="text-org4ed9aef">
<ul class="org-ul">
<li>(ℝ, +) est un groupe commutatif<br /></li>
<li>x est une loi associative : (a x b) x c = a x (b x c)<br /></li>
<li>On peut distribuer x par rapport a + : (a + b) x c = (a x c) + (b x c)<br /></li>
<li>Il existe un élément neutre de x which is 1 : a x 1 = 1 x a = a<br /></li>
<li>La multiplication est commutative : a x b = b x a<br /></li>
</ul>

<p>
Oui c&rsquo;est un anneau<br />
</p>
</div>
</div>
<div id="outline-container-org248a5ea" class="outline-4">
<h4 id="org248a5ea">Est-ce un corps ?</h4>
<div class="outline-text-4" id="text-org248a5ea">
<ul class="org-ul">
<li>Oui : ∀ x ∈ ℝ\{e} ; x * x&rsquo; = 1<br /></li>
</ul>
</div>
</div>
</div>
</div>
<div id="outline-container-org0b3fce2" class="outline-2">
<h2 id="org0b3fce2">2nd cours :L&rsquo;ordre dans ℝ, Majorant, minorant, borne superieure, borne inférieure <i>Oct 3</i> :</h2>
<div class="outline-text-2" id="text-org0b3fce2">
</div>
<div id="outline-container-orga3c4b3c" class="outline-3">
<h3 id="orga3c4b3c">L&rsquo;ordre dans ℝ</h3>
<div class="outline-text-3" id="text-orga3c4b3c">
<p>
(ℝ, +, x) est un corps, Soit R une relation d&rsquo;ordre dans ℝ si :<br />
</p>

<ol class="org-ol">
<li><p>
R est antisymétrique :<br />
</p>

<p>
∀ x, y ℝ  ; (x R y et y R x) ⇒ (x = y)<br />
</p></li>

<li><p>
R est reflexive :<br />
</p>

<p>
∀ x ∈ ℝ ; x R x<br />
</p></li>

<li>R est transitive :<br />
∀ x, y, z ∈ ℝ , (x R y and y R z) ⇒ x R z<br /></li>
</ol>
</div>
<div id="outline-container-org9b04907" class="outline-4">
<h4 id="org9b04907">Exemples :</h4>
<div class="outline-text-4" id="text-org9b04907">
</div>
<ul class="org-ul">
<li><a id="org10940af"></a>Exemple numéro 1:<br />
<div class="outline-text-5" id="text-org10940af">
<p>
(ℝ , +, x) est un corps. Est ce la relation &lt; est une relation d&rsquo;ordre dans ℝ ?<br />
</p>


<p>
Non, pourquoi ? parce que elle est pas réflexive : ∀ x ∈ ℝ, x &lt; x <b><b>is obviously false</b></b><br />
</p>
</div>
</li>
<li><a id="org47b3e4d"></a>Exemple numéro 2:<br />
<div class="outline-text-5" id="text-org47b3e4d">
<p>
(ℝ , +, x) est un corps. Est ce la relation ≥ est une relation d&rsquo;ordre dans ℝ ?<br />
</p>

<ol class="org-ol">
<li>(Antisymétrique) ∀ x, y ℝ ; (x ≥ y AND y ≥ x) ⇒ x = y  is true<br /></li>
<li>(Réflexive) ∀ x, y ℝ ; x ≥ x is true<br /></li>
<li>(Transitive) ∀ x, y, z ℝ ; (x ≥ y AND y ≥ z) ⇒ x ≥ z is also true<br /></li>
</ol>
</div>
</li>
</ul>
</div>
</div>
<div id="outline-container-org824efff" class="outline-3">
<h3 id="org824efff">Majorant, minorant, borne supérieure, borne inférieure</h3>
<div class="outline-text-3" id="text-org824efff">
</div>
<div id="outline-container-org34c228b" class="outline-4">
<h4 id="org34c228b">Majorant:</h4>
<div class="outline-text-4" id="text-org34c228b">
<p>
Soit E un sous-ensemble de ℝ (E ⊆ ℝ)<br />
</p>


<p>
Soit a ∈ ℝ, a est un majorant de E Si :∀ x ∈ E , x ≤ a<br />
</p>
</div>
</div>
<div id="outline-container-orgc832fb0" class="outline-4">
<h4 id="orgc832fb0">Minorant:</h4>
<div class="outline-text-4" id="text-orgc832fb0">
<p>
Soit E un sous-ensemble de ℝ (E ⊆ ℝ)<br />
</p>


<p>
Soit b ∈ ℝ, b est un minorant de E Si :∀ x ∈ E , x ≥ b<br />
</p>
</div>
</div>
<div id="outline-container-org3cb02e2" class="outline-4">
<h4 id="org3cb02e2">Borne supérieure:</h4>
<div class="outline-text-4" id="text-org3cb02e2">
<p>
La borne supérieure est le plus petit des majorants <i>Sup(E) = Borne supérieure</i><br />
</p>
</div>
</div>
<div id="outline-container-orgef4458e" class="outline-4">
<h4 id="orgef4458e">Borne inférieure:</h4>
<div class="outline-text-4" id="text-orgef4458e">
<p>
La borne inférieure est le plus grand des minorant <i>Inf (E) = Borne inférieure</i><br />
</p>
</div>
</div>
<div id="outline-container-org2b2908f" class="outline-4">
<h4 id="org2b2908f">Maximum :</h4>
<div class="outline-text-4" id="text-org2b2908f">
<p>
E ⊆ ℝ, a est un maximum de E (Max(E)) Si : a ∈ E ; ∀x ∈ E, x ≤ a.<br />
</p>
</div>
</div>
<div id="outline-container-org1410a06" class="outline-4">
<h4 id="org1410a06">Minimum :</h4>
<div class="outline-text-4" id="text-org1410a06">
<p>
E ⊆ ℝ, b est un minimum de E (Min(E)) Si : b ∈ E ; ∀x ∈ E, x ≥ b.<br />
</p>
</div>
</div>
<div id="outline-container-orgd1fcd4e" class="outline-4">
<h4 id="orgd1fcd4e">Remarques :</h4>
<div class="outline-text-4" id="text-orgd1fcd4e">
<p>
A et B deux ensembles bornés (Minoré et Majoré) :<br />
</p>
<ol class="org-ol">
<li>A ∪ B est borné<br /></li>
<li>A ∩ B est borné<br /></li>
<li>Sup(A ∪ B)= Max(sup A, sup B)<br /></li>
<li>Inf (A ∩ B)= Min(inf A, inf B)<br /></li>
<li>Sup(A ∩ B)= Min(sup A, sup B) <i>Le plus petit des Supérieur de A et B</i><br /></li>
<li>Inf (A ∩ B)= Max(inf A, inf B) <i>Le plus grand des inférieur de A et B</i><br /></li>
</ol>
</div>
</div>
</div>
</div>
<div id="outline-container-orgc939931" class="outline-2">
<h2 id="orgc939931">3rd cours :Les suites numériques <i>Oct 5</i> :</h2>
<div class="outline-text-2" id="text-orgc939931">
</div>
<div id="outline-container-org8607984" class="outline-4">
<h4 id="org8607984">Définition :</h4>
<div class="outline-text-4" id="text-org8607984">
<p>
Soit (Un)n ∈ ℕ une suite numérique , (Un)n est une application de ℕ dans ℝ:<br />
</p>


<p>
ℕ -&#x2014;&gt; ℝ<br />
</p>


<p>
n -&#x2014;&gt; U(n) = Un<br />
</p>

<ol class="org-ol">
<li>(Un) ou (Un)n ∈ ℝ : une suite<br /></li>
<li>Un : terme général<br /></li>
</ol>
</div>
<ul class="org-ul">
<li><a id="org51d3f5d"></a>Exemple :<br />
<div class="outline-text-6" id="text-org51d3f5d">
<p>
U : ℕ* -&#x2014;&gt; ℝ<br />
</p>


<p>
n  -&#x2014;&gt; 1/n<br />
</p>


<p>
(Un) est une suite définit par Un = 1/n<br />
</p>
</div>
</li>
</ul>
</div>
<div id="outline-container-orgcc2100f" class="outline-4">
<h4 id="orgcc2100f">Définition N°2 :</h4>
<div class="outline-text-4" id="text-orgcc2100f">
<p>
On peut définir une suite â partir d&rsquo;une relation de récurrence entre deux termes successifs et le premier terme.<br />
</p>
</div>
<ul class="org-ul">
<li><a id="org6b68ae0"></a>Exemple :<br />
<div class="outline-text-6" id="text-org6b68ae0">
<p>
U(n+1) = Un /2<br />
</p>


<p>
U(1)= 1<br />
</p>
</div>
</li>
</ul>
</div>
<div id="outline-container-org69f8c52" class="outline-3">
<h3 id="org69f8c52">Opérations sur les suites :</h3>
<div class="outline-text-3" id="text-org69f8c52">
</div>
<div id="outline-container-orgf01d039" class="outline-4">
<h4 id="orgf01d039">La somme :</h4>
<div class="outline-text-4" id="text-orgf01d039">
<p>
Soient (Un) et (Vn) deux suites, la somme de (Un) et (Vn) est une suite de terme général Un + Vn<br />
</p>
</div>
</div>
<div id="outline-container-org770eaba" class="outline-4">
<h4 id="org770eaba">Le produit :</h4>
<div class="outline-text-4" id="text-org770eaba">
<p>
Soient (Un)n et (Vn)n deux suites alors (Un) x (Vn) est une autre suite de terme général Un x Vn<br />
</p>
</div>
</div>
<div id="outline-container-org7a41073" class="outline-4">
<h4 id="org7a41073">Inverse d&rsquo;une suite :</h4>
<div class="outline-text-4" id="text-org7a41073">
<p>
Soit Un une suite de terme général Un alors l&rsquo;inverse de (Un) est une autre suite (Vn) = 1/(Un) de terme général de Vn = 1/Un<br />
</p>
</div>
</div>
<div id="outline-container-orgd245f39" class="outline-4">
<h4 id="orgd245f39">Produit d&rsquo;une suite par un scalaire :</h4>
<div class="outline-text-4" id="text-orgd245f39">
<p>
Soit (Un) une suite de T.G Un<br />
</p>


<p>
∀ λ ∈ ℝ , λ(Un) n ∈ ℕ est une suite de T.G Vn= λUn<br />
</p>
</div>
</div>
</div>
<div id="outline-container-orgd7a311f" class="outline-3">
<h3 id="orgd7a311f">Suite bornée :</h3>
<div class="outline-text-3" id="text-orgd7a311f">
<p>
Une suite (Un) est bornée si (Un) majorée et minorée<br />
</p>
</div>
</div>
<div id="outline-container-org2b180d2" class="outline-3">
<h3 id="org2b180d2">Suite majorée :</h3>
<div class="outline-text-3" id="text-org2b180d2">
<p>
Soit (Un) une suite<br />
</p>


<p>
U : (Un) est majorée par M ∈ ℝ ; ∀ n ∈ ℕ ; ∃ M ∈ ℝ , Un ≤ M<br />
</p>
</div>
</div>
