m/crystal/src/org/uni_notes/analyse1.org
** Suite minorée :
Soit (Un) une suite


U : (Un) est minorée par M ∈ ℝ ; ∀ n ∈ ℕ ; ∃ M ∈ ℝ , Un ≥ M

** Suites monotones :
*** Les suites croissantes :
Soit (Un)n est une suite


(Un) est croissante si : ∀ n ∈ ℕ ;  U(n+1) - Un ≥ 0  ⇔ Un+1 ≥ Un

*** Les suites décroissantes :
Soit (Un)n est une suite


(Un) est décroissante si : ∀ n ∈ ℕ ;  U(n+1) - Un ≤ 0  ⇔ Un+1 ≤ Un


* Série TD N°1 : /Oct 6/
** Exo 1 :
*** Ensemble A :

A = {-1/n , n ∈ ℕ *}

**** Borne inférieure
∀ n ∈  ℕ*  , -1/n ≥ -1 . -1 est la borne inférieure de l'ensemble A

**** Minimum :
∀ n ∈  ℕ*  , -1/n ≥ -1 . -1 est le Minimum de l'ensemble A

**** Borne supérieure :
∀ n ∈  ℕ*  , -1/n ≤ 0 . 0 est la borne supérieure de l'ensemble A
**** Maximum :
L'ensemble A n'as pas de maximum
*** Ensemble B :
B = [-1 , 3[ ∩ ℚ
**** Borne inférieure :
Inf (B) = Max(inf ([-1 , 3[) , inf (ℚ))


Puisse que ℚ n'as pas de Borne inférieure, donc par convention c'est  *-∞*,


*Inf (B) = -1*

**** Borne supérieure :
Sup(B) = Min(sup([-1 ,3[) , sup(ℚ))


Puisse que ℚ n'as pas de Borne supérieure, donc par convention c'est  *+∞*,


*Sup(B) = 3*

**** Minimum :
*Min(B) = -1*

**** Maximum :
L'ensemble B n'as pas de Maximum
*** Ensemble C :
C = {3n ,n ∈ ℕ}

**** Borne inférieure :
Inf (C) = 0

**** Borne supérieure :
Sup(C) = +∞
**** Minimum :
Min(C) = 0
**** Maximum :
L'ensemble C n'as pas de Maximum

*** Ensemble D :
D = {1 - 1/n , n ∈ ℕ*}
**** Borne inférieure :
Inf (D)= 0
**** Borne supérieure :
Sup(D)= 1
**** Minimum :
Min(D)= 0
**** Maximum :
L'ensemble D n'as pas de Maximum

*** Ensemble E :
E = { [2n + (-1)^n]/ n + 1 , n ∈ ℕ }


*Les valeurs que E peut prendre sont : "(2n + 1)/(n+1)" Si n est pair, et "(2n - 1)/(n+1)" si n est impair*


*On définit un ensemble F et G : F = { (2n + 1)/ (n+1) , n ∈ 2k},  G = { (2n - 1)/(n+1), n ∈ 2k+1}*


*Donc E = F ∪ G*

**** Borne inférieure :
Inf (E) = Min(inf (F), inf (G))


Inf (F) = 1 ; Inf (G) = -1


*Inf (E)= -1*

**** Borne supérieure :
Sup(E) = Max(sup(F), sup(G))


sup(F) = +∞ ; sup(G) = +∞


*Sup(E)= +∞*
**** Minimum :
Min(E)= -1
**** Maximum :
E n'as pas de maximum
** Exo 2 :
*** Ensemble A :
A = {x ∈ ℝ , 0 < x <√3}

**** Borné
*Oui*, Inf (A)= 0 ; Sup(A)=√3
*** Ensemble B :
B = { x ∈ ℝ , 1/2 < sin x <√3/2} ;
**** Borné
*∀ x ∈ B, sin x > 1/2 ∴ Inf (B)= 1/2*


*∀ x ∈ B, sin x < √3/2 ∴ Sup(B)= √3/2*
*** Ensemble C :
C = {x ∈  ℝ , x³ > 3}
**** Minoré
*∀ x ∈ C, x³ > 3 ∴ Inf (C)= 3*
*** Ensemble D :
D = {x ∈ ℝ , e^x < 1/2}
**** Borné
*∀ x ∈ C, e^x > 0 ∴ Inf (C)= 0*


*∀ x ∈ C, e^x < 1/2 ∴ Sup(C)= 1/2*
*** Ensemble E :
E = {x ∈ ℝ , ∃ p ∈ ℕ* : x = √2/p}
**** Majoré
p = √2/x . Donc : *Sup(E)=1*
** Exo 3 :
U0 = 3/2 ; U(n+1) = (Un - 1)² + 1
*** Question 1 :
Montrer que : ∀ n ∈ ℕ , 1 < Un < 2 .


*(Un - 1)² ≥ 0 /Parce que c'est un carré/*


*(Un - 1)² + 1 > 1* ; *U(n+1) ≥ 1*


**** Raisonnement par récurrence :
P(n) : ∀ n ∈ ℕ ; 1 < Un < 2


P(0) est vraie : 1 < 3/2 < 2


On suppose que P(n) est vraie et on vérifie P(n+1) pour une contradiction


1< Un < 2 ; 0 < Un - 1 < 1 ; 0 < (Un - 1)² < 1 ; 1 < (Un - 1)² + 1< 2 ; *1 < U(n+1) < 2* Donc elle est correcte

*** Question 2 :
Montrer que (Un)n est strictement monotone :


*U(n+1) - Un = (Un - 1)² + 1 - Un* ; *U(n+1) - Un = Un² + 1 - 2Un + 1 - Un* ; *U(n+1) - Un = Un² - 3Un + 2*


On étudie *Un² - 3Un + 2* sur l'intervalle ]1, 2[ : Un² - 3Un + 2 = 0 est une équation du 2nd ordre, *Δ = 1* , elle accepte deux solutions : Un = 1 et Un = 2


On déduit que *Un² - 3Un + 2* est négatif sur [1 , 2] et positif en dehors, donc *∀ 1 < Un < 2 , Un² - 3Un + 2 < 0* ; *∀ 1 < Un < 2 , U(n+1) - Un < 0* ; *∀ 1 < Un < 2 , U(n+1) < Un* Donc (Un)n est une suite strictement monotonne décroissante
* 4th cours (Suite) : /Oct 10/
** Les suites convergentes
Soit (Un)n est une suite convergente si lim Un n--> +∞ = l
