m/crystal/uni_notes/analyse.html
<div id="outline-container-org7b2e23f" class="outline-3">
<h3 id="org7b2e23f">Suite minorée :</h3>
<div class="outline-text-3" id="text-org7b2e23f">
<p>
Soit (Un) une suite<br />
</p>


<p>
U : (Un) est minorée par M ∈ ℝ ; ∀ n ∈ ℕ ; ∃ M ∈ ℝ , Un ≥ M<br />
</p>
</div>
</div>
<div id="outline-container-orgb167fb6" class="outline-3">
<h3 id="orgb167fb6">Suites monotones :</h3>
<div class="outline-text-3" id="text-orgb167fb6">
</div>
<div id="outline-container-org28ff308" class="outline-4">
<h4 id="org28ff308">Les suites croissantes :</h4>
<div class="outline-text-4" id="text-org28ff308">
<p>
Soit (Un)n est une suite<br />
</p>


<p>
(Un) est croissante si : ∀ n ∈ ℕ ;  U(n+1) - Un ≥ 0  ⇔ Un+1 ≥ Un<br />
</p>
</div>
</div>
<div id="outline-container-org89d3d3b" class="outline-4">
<h4 id="org89d3d3b">Les suites décroissantes :</h4>
<div class="outline-text-4" id="text-org89d3d3b">
<p>
Soit (Un)n est une suite<br />
</p>


<p>
(Un) est décroissante si : ∀ n ∈ ℕ ;  U(n+1) - Un ≤ 0  ⇔ Un+1 ≤ Un<br />
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-org65657c4" class="outline-2">
<h2 id="org65657c4">Série TD N°1 : <i>Oct 6</i></h2>
<div class="outline-text-2" id="text-org65657c4">
</div>
<div id="outline-container-orgac13612" class="outline-3">
<h3 id="orgac13612">Exo 1 :</h3>
<div class="outline-text-3" id="text-orgac13612">
</div>
<div id="outline-container-orgcb1b828" class="outline-4">
<h4 id="orgcb1b828">Ensemble A :</h4>
<div class="outline-text-4" id="text-orgcb1b828">
<p>
A = {-1/n , n ∈ ℕ *}<br />
</p>
</div>
<ul class="org-ul">
<li><a id="org47ef9df"></a>Borne inférieure<br />
<div class="outline-text-5" id="text-org47ef9df">
<p>
∀ n ∈  ℕ*  , -1/n ≥ -1 . -1 est la borne inférieure de l&rsquo;ensemble A<br />
</p>
</div>
</li>
<li><a id="orgd07d16e"></a>Minimum :<br />
<div class="outline-text-5" id="text-orgd07d16e">
<p>
∀ n ∈  ℕ*  , -1/n ≥ -1 . -1 est le Minimum de l&rsquo;ensemble A<br />
</p>
</div>
</li>
<li><a id="org04fdb17"></a>Borne supérieure :<br />
<div class="outline-text-5" id="text-org04fdb17">
<p>
∀ n ∈  ℕ*  , -1/n ≤ 0 . 0 est la borne supérieure de l&rsquo;ensemble A<br />
</p>
</div>
</li>
<li><a id="org8029216"></a>Maximum :<br />
<div class="outline-text-5" id="text-org8029216">
<p>
L&rsquo;ensemble A n&rsquo;as pas de maximum<br />
</p>
</div>
</li>
</ul>
</div>
<div id="outline-container-org886db21" class="outline-4">
<h4 id="org886db21">Ensemble B :</h4>
<div class="outline-text-4" id="text-org886db21">
<p>
B = [-1 , 3[ ∩ ℚ<br />
</p>
</div>
<ul class="org-ul">
<li><a id="orgcde09bc"></a>Borne inférieure :<br />
<div class="outline-text-5" id="text-orgcde09bc">
<p>
Inf (B) = Max(inf ([-1 , 3[) , inf (ℚ))<br />
</p>


<p>
Puisse que ℚ n&rsquo;as pas de Borne inférieure, donc par convention c&rsquo;est  <b>-∞</b>,<br />
</p>


<p>
<b>Inf (B) = -1</b><br />
</p>
</div>
</li>
<li><a id="orgd0b46a7"></a>Borne supérieure :<br />
<div class="outline-text-5" id="text-orgd0b46a7">
<p>
Sup(B) = Min(sup([-1 ,3[) , sup(ℚ))<br />
</p>


<p>
Puisse que ℚ n&rsquo;as pas de Borne supérieure, donc par convention c&rsquo;est  <b>+∞</b>,<br />
</p>


<p>
<b>Sup(B) = 3</b><br />
</p>
</div>
</li>
<li><a id="orgdd05682"></a>Minimum :<br />
<div class="outline-text-5" id="text-orgdd05682">
<p>
<b>Min(B) = -1</b><br />
</p>
</div>
</li>
<li><a id="org2f56d5c"></a>Maximum :<br />
<div class="outline-text-5" id="text-org2f56d5c">
<p>
L&rsquo;ensemble B n&rsquo;as pas de Maximum<br />
</p>
</div>
</li>
</ul>
</div>
<div id="outline-container-org8444304" class="outline-4">
<h4 id="org8444304">Ensemble C :</h4>
<div class="outline-text-4" id="text-org8444304">
<p>
C = {3n ,n ∈ ℕ}<br />
</p>
</div>
<ul class="org-ul">
<li><a id="org71172ed"></a>Borne inférieure :<br />
<div class="outline-text-5" id="text-org71172ed">
<p>
Inf (C) = 0<br />
</p>
</div>
</li>
<li><a id="orgd7dc786"></a>Borne supérieure :<br />
<div class="outline-text-5" id="text-orgd7dc786">
<p>
Sup(C) = +∞<br />
</p>
</div>
</li>
<li><a id="org48d58aa"></a>Minimum :<br />
<div class="outline-text-5" id="text-org48d58aa">
<p>
Min(C) = 0<br />
</p>
</div>
</li>
<li><a id="org2f05d94"></a>Maximum :<br />
<div class="outline-text-5" id="text-org2f05d94">
<p>
L&rsquo;ensemble C n&rsquo;as pas de Maximum<br />
</p>
</div>
</li>
</ul>
</div>
<div id="outline-container-org655bbdc" class="outline-4">
<h4 id="org655bbdc">Ensemble D :</h4>
<div class="outline-text-4" id="text-org655bbdc">
<p>
D = {1 - 1/n , n ∈ ℕ*}<br />
</p>
</div>
<ul class="org-ul">
<li><a id="orgcb1e6fa"></a>Borne inférieure :<br />
<div class="outline-text-5" id="text-orgcb1e6fa">
<p>
Inf (D)= 0<br />
</p>
</div>
</li>
<li><a id="org865b9b0"></a>Borne supérieure :<br />
<div class="outline-text-5" id="text-org865b9b0">
<p>
Sup(D)= 1<br />
</p>
</div>
</li>
<li><a id="org9a1de73"></a>Minimum :<br />
<div class="outline-text-5" id="text-org9a1de73">
<p>
Min(D)= 0<br />
</p>
</div>
</li>
<li><a id="org1987362"></a>Maximum :<br />
<div class="outline-text-5" id="text-org1987362">
<p>
L&rsquo;ensemble D n&rsquo;as pas de Maximum<br />
</p>
</div>
</li>
</ul>
</div>
<div id="outline-container-orgf122a29" class="outline-4">
<h4 id="orgf122a29">Ensemble E :</h4>
<div class="outline-text-4" id="text-orgf122a29">
<p>
E = { [2n + (-1)^n]/ n + 1 , n ∈ ℕ }<br />
</p>


<p>
<b>Les valeurs que E peut prendre sont : &ldquo;(2n + 1)/(n+1)&rdquo; Si n est pair, et &ldquo;(2n - 1)/(n+1)&rdquo; si n est impair</b><br />
</p>


<p>
<b>On définit un ensemble F et G : F = { (2n + 1)/ (n+1) , n ∈ 2k},  G = { (2n - 1)/(n+1), n ∈ 2k+1}</b><br />
</p>


<p>
<b>Donc E = F ∪ G</b><br />
</p>
</div>
<ul class="org-ul">
<li><a id="org45d0ef4"></a>Borne inférieure :<br />
<div class="outline-text-5" id="text-org45d0ef4">
<p>
Inf (E) = Min(inf (F), inf (G))<br />
</p>


<p>
Inf (F) = 1 ; Inf (G) = -1<br />
</p>


<p>
<b>Inf (E)= -1</b><br />
</p>
</div>
</li>
<li><a id="org5ef627a"></a>Borne supérieure :<br />
<div class="outline-text-5" id="text-org5ef627a">
<p>
Sup(E) = Max(sup(F), sup(G))<br />
</p>


<p>
sup(F) = +∞ ; sup(G) = +∞<br />
</p>


<p>
<b>Sup(E)= +∞</b><br />
</p>
</div>
</li>
<li><a id="orgef4c9c4"></a>Minimum :<br />
<div class="outline-text-5" id="text-orgef4c9c4">
<p>
Min(E)= -1<br />
</p>
</div>
</li>
<li><a id="org49b27f7"></a>Maximum :<br />
<div class="outline-text-5" id="text-org49b27f7">
<p>
E n&rsquo;as pas de maximum<br />
</p>
</div>
</li>
</ul>
</div>
</div>
<div id="outline-container-org5e26290" class="outline-3">
<h3 id="org5e26290">Exo 2 :</h3>
<div class="outline-text-3" id="text-org5e26290">
</div>
<div id="outline-container-org62a0c2c" class="outline-4">
<h4 id="org62a0c2c">Ensemble A :</h4>
<div class="outline-text-4" id="text-org62a0c2c">
<p>
A = {x ∈ ℝ , 0 &lt; x &lt;√3}<br />
</p>
</div>
<ul class="org-ul">
<li><a id="org89ac7fa"></a>Borné<br />
<div class="outline-text-5" id="text-org89ac7fa">
<p>
<b>Oui</b>, Inf (A)= 0 ; Sup(A)=√3<br />
</p>
</div>
</li>
</ul>
</div>
<div id="outline-container-orgdde4c67" class="outline-4">
<h4 id="orgdde4c67">Ensemble B :</h4>
<div class="outline-text-4" id="text-orgdde4c67">
<p>
B = { x ∈ ℝ , 1/2 &lt; sin x &lt;√3/2} ;<br />
</p>
</div>
<ul class="org-ul">
<li><a id="org2a13712"></a>Borné<br />
<div class="outline-text-5" id="text-org2a13712">
<p>
<b>∀ x ∈ B, sin x &gt; 1/2 ∴ Inf (B)= 1/2</b><br />
</p>


<p>
<b>∀ x ∈ B, sin x &lt; √3/2 ∴ Sup(B)= √3/2</b><br />
</p>
</div>
</li>
</ul>
</div>
<div id="outline-container-org2abc744" class="outline-4">
<h4 id="org2abc744">Ensemble C :</h4>
<div class="outline-text-4" id="text-org2abc744">
<p>
C = {x ∈  ℝ , x³ &gt; 3}<br />
</p>
</div>
<ul class="org-ul">
<li><a id="org6a12e74"></a>Minoré<br />
<div class="outline-text-5" id="text-org6a12e74">
<p>
<b>∀ x ∈ C, x³ &gt; 3 ∴ Inf (C)= 3</b><br />
</p>
</div>
</li>
</ul>
</div>
<div id="outline-container-orga2cb085" class="outline-4">
<h4 id="orga2cb085">Ensemble D :</h4>
<div class="outline-text-4" id="text-orga2cb085">
<p>
D = {x ∈ ℝ , e^x &lt; 1/2}<br />
</p>
</div>
<ul class="org-ul">
<li><a id="org42d90c1"></a>Borné<br />
<div class="outline-text-5" id="text-org42d90c1">
<p>
<b>∀ x ∈ C, e^x &gt; 0 ∴ Inf (C)= 0</b><br />
</p>


<p>
<b>∀ x ∈ C, e^x &lt; 1/2 ∴ Sup(C)= 1/2</b><br />
</p>
</div>
</li>
</ul>
</div>
<div id="outline-container-orgc6452f9" class="outline-4">
<h4 id="orgc6452f9">Ensemble E :</h4>
<div class="outline-text-4" id="text-orgc6452f9">
<p>
E = {x ∈ ℝ , ∃ p ∈ ℕ* : x = √2/p}<br />
</p>
</div>
<ul class="org-ul">
<li><a id="org8696739"></a>Majoré<br />
<div class="outline-text-5" id="text-org8696739">
<p>
p = √2/x . Donc : <b>Sup(E)=1</b><br />
</p>
</div>
</li>
</ul>
</div>
</div>
<div id="outline-container-org479db70" class="outline-3">
<h3 id="org479db70">Exo 3 :</h3>
<div class="outline-text-3" id="text-org479db70">
<p>
U0 = 3/2 ; U(n+1) = (Un - 1)² + 1<br />
</p>
</div>
<div id="outline-container-org9f28f97" class="outline-4">
<h4 id="org9f28f97">Question 1 :</h4>
<div class="outline-text-4" id="text-org9f28f97">
<p>
Montrer que : ∀ n ∈ ℕ , 1 &lt; Un &lt; 2 .<br />
</p>


<p>
<b>(Un - 1)² ≥ 0 <i>Parce que c&rsquo;est un carré</i></b><br />
</p>


<p>
<b>(Un - 1)² + 1 &gt; 1</b> ; <b>U(n+1) ≥ 1</b><br />
</p>
</div>
<ul class="org-ul">
<li><a id="orgf620b41"></a>Raisonnement par récurrence :<br />
<div class="outline-text-5" id="text-orgf620b41">
<p>
P(n) : ∀ n ∈ ℕ ; 1 &lt; Un &lt; 2<br />
</p>


<p>
P(0) est vraie : 1 &lt; 3/2 &lt; 2<br />
</p>


<p>
On suppose que P(n) est vraie et on vérifie P(n+1) pour une contradiction<br />
</p>


<p>
1&lt; Un &lt; 2 ; 0 &lt; Un - 1 &lt; 1 ; 0 &lt; (Un - 1)² &lt; 1 ; 1 &lt; (Un - 1)² + 1&lt; 2 ; <b>1 &lt; U(n+1) &lt; 2</b> Donc elle est correcte<br />
</p>
</div>
</li>
</ul>
</div>
<div id="outline-container-orgb2a312c" class="outline-4">
<h4 id="orgb2a312c">Question 2 :</h4>
<div class="outline-text-4" id="text-orgb2a312c">
<p>
Montrer que (Un)n est strictement monotone :<br />
</p>


<p>
<b>U(n+1) - Un = (Un - 1)² + 1 - Un</b> ; <b>U(n+1) - Un = Un² + 1 - 2Un + 1 - Un</b> ; <b>U(n+1) - Un = Un² - 3Un + 2</b><br />
</p>


<p>
On étudie <b>Un² - 3Un + 2</b> sur l&rsquo;intervalle ]1, 2[ : Un² - 3Un + 2 = 0 est une équation du 2nd ordre, <b>Δ = 1</b> , elle accepte deux solutions : Un = 1 et Un = 2<br />
</p>


<p>
On déduit que <b>Un² - 3Un + 2</b> est négatif sur [1 , 2] et positif en dehors, donc <b>∀ 1 &lt; Un &lt; 2 , Un² - 3Un + 2 &lt; 0</b> ; <b>∀ 1 &lt; Un &lt; 2 , U(n+1) - Un &lt; 0</b> ; <b>∀ 1 &lt; Un &lt; 2 , U(n+1) &lt; Un</b> Donc (Un)n est une suite strictement monotonne décroissante<br />
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-orgbd1bb1e" class="outline-2">
<h2 id="orgbd1bb1e">4th cours (Suite) : <i>Oct 10</i></h2>
<div class="outline-text-2" id="text-orgbd1bb1e">
</div>
<div id="outline-container-org9b40096" class="outline-3">
<h3 id="org9b40096">Les suites convergentes</h3>
<div class="outline-text-3" id="text-org9b40096">
<p>
Soit (Un)n est une suite convergente si lim Un n&#x2013;&gt; +∞ = l<br />
</p>
</div>
