m/crystal/src/org/uni_notes/analyse1.org
*** Remarque :
1. Un est une suite convergente alors Un est bornee
2. Un est une suite convergente  lim Un n---> +∞ = l ⇔ lim |Un| n---> +∞ = |l|
3. Un est une suite majoree et croissante ⇒ Un converge
4. Un est une suite minoree et decroissante ⇒ Un converge
5. Soient (Un) et (Vn) deux suites convergentes, alors
   a. Un + Vn est convergente
   b. Un * Vn est convergente
   c. ∀λ ∈ ℝ , (λUn) converge
6. Soit Un est une suite bornee et soit Vn une suite. lim Vn n->+∞ = 0 Alors lim Vn * Un n-> +∞ = 0
** Theoreme d'encadrement
Soient Un Vn et Wn trois suites ∀n ∈ ℕ, Un ≤ Vn ≤ Wn . et lim Un n->∞ = lim Wn n-> +∞  = l ⇒ lim Vn n-> +∞ = l
** Suites arithmetiques
Un est une suite arithmetique si : U(n+1) = Un + r ; r etant la raison de la suite
*** Forme general
*Un = U0 + nr* ; *Un = Up + (n - p)r*
*** Somme des n premiers termes
Un est une suite arithmetique, Sn = [(U0 + Un)(n + 1)]/2


Sn = (n, k = 0)ΣUk est une somme partielle et lim Sn n->+∞ = k≥0ΣUk est une serie
** Suites géométriques
*** Forme general
*Un = U0 x r^n*
*** Somme des n premiers termes
n ∈ ℕ\{1} Sn = U0 (1 - r^(n+1))/1-r
* 5th cours (suite) : /Oct 12/
** Suites adjacentes:
Soient (Un) et (Vn) deux suites, elles sont adjacentes si:
1. (Un) est croissante et (Vn) est décroissante
2. Un ≤ Vn
3. lim (Un - Vn) n->+∞ = 0
** Suites extraites (sous-suites):
Soit (Un) une suite: ;U: ℕ ----> ℝ ;   n ----> Un ;ϕ: ℕ ----> ℕ ;   n ----> ϕn ;(U(ϕ(n))) est appelée une sous suite de (Un) ou bien une suite extraite.
*** Remarques:
a. Si (Un) converge ⇒ ∀ n ∈ ℕ , U(ϕ(n)) converge aussi.
b. Mais le contraire n'es pas toujours vrais.
c. U(2n) et U(2n+1) convergent vers la même limite (l), alors Un aussi converge vers l
** Suites de Cauchy:
(Un) n ∈ ℕ est une suite de Cauchy Si ; ;∀ ε > 0 , ∃ N ∈ ℕ ; ∀ n > m > N ; |Un - Um| < ε
*** Remarque :
1. Toute suite convergente est une suite de Cauchy et toute suite Cauchy est une suite convergente
** Théorème de Bolzano Weirstrass:
On peut extraire une sous suite convergente de toute suite bornée
* Chapitre 3 : Les limites et la continuité /Nov 14/
** Fonction réelle à variable réelle :
Soit  f : I --> ℝ , I ⊂= ℝ
         x --> f (x)
*** L'ensemble de départ :
L'ensemble de définition (Df)
**** Propriétés:
Soit f et g deux fonctions :
f : I --> ℝ
    x --> f (x)

g : I --> ℝ
    x --> g(x)
***** 1) f+g
(g+f): I --> ℝ
       x --> (f+g)(x) = f (x) + g(x)
***** 2) λf
∀λ ∈ ℝ : λf : I --> ℝ
              x --> (λf)(x) = λf (x)
***** 3) f*g
(f*g): I --> ℝ
       x --> (f*g)(x) = f (x) x g(x)
***** 4) f/g
f/g :  I --> ℝ
       x --> f (x)/g(x) , g(x) ≠ 0
*** Les Limites :
f : I --> ℝ
   x --> f (x)
   x_{0} ∈ I ; x_{0} extrémité de l'intervalle.

   Lim_{x --> x_{0}} f (x) est a Limite de f (x) quand x tend vers x_{0}
**** Lim_{x --> x_{0}} f (x) = l
=> |x - x_{0}| < ẟ , |f (x) - l| < ε

*** La continuité :
Soit f : I --> ℝ         I = Df
        x --> f (x)      x_{0} ∈ I
f est continue en x_{0} ⇔ Lim_{x --> x_{0}} f (x) = f (x_{0})
∀ε > 0 , ∃ẟ > 0 , |x - x_{0}| < ẟ ⇒ |f (x) - f (x_{0})| < ε
*** Prolongement par continuité :
Soit f : I/ {x_{0}} --> ℝ
        x --> f (x)

Si lim_{x --> x_{0}} f (x) = l Alors f est prolongéable par continuité en x_{0}

On défini :
f~ = f (x) si x ≠ x_{0}
ET
l si x = x_{0}
           f~ : I --> ℝ
                x --> f (x)
*** Théorème des valeurs intermédiaires :
f : [a,b] --> ℝ
Si f est continue sur [a,b]
Alors ∀y ∈ f ([a,b]) ⇒ ∃x ∈ [a,b] ; y = f (x)

1. Si f est continue sur [a,b]
2. Si f (a) * f (b) < 0
Donc ∃ c ∈ ]a,b[ , f (c) = 0
*** Fonction croissante :
f : I --> J
    f est croissante si ∀ x_{1},x_{2} ∈ I
        x_{1} < x_{2} ⇒ f (x_{1}) ≤ f (x_{2})

    f est strictement croissante si ∀ x_{1},x_{2} ∈ I
        x_{1} < x_{2} ⇒ f (x_{1}) < f (x_{2})

Si f est croissante ou décroissante, alors elle est bornée.
*** Injection = Strictement monotonne :
f : I --> J
f est injective si ∀ x_{1},x_{2} ∈ I , f (x_{1}) = f (x_{2}) ⇒ x_{1} = x_{2}
*** Surjection = Continuité :
f est surjective si ∀ y ∈ J, ∃ x ∈ I , y = f (x)
*** Bijection :
Si f est injective et surjective, alors f est bijective
f est bijective donc elle admet une bijection réciproque
*** Théorème de bijection :
Si f est continue et strictement monotone alors elle est bijective.
f admet une bijection réciproque f{-1}.
f{-1} a le même sens de variation que f.

