m/crystal/uni_notes/analyse.html
<div id="outline-container-org6a22c62" class="outline-4">
<h4 id="org6a22c62">Remarque :</h4>
<div class="outline-text-4" id="text-org6a22c62">
<ol class="org-ol">
<li>Un est une suite convergente alors Un est bornee<br /></li>
<li>Un est une suite convergente  lim Un n&#x2014;&gt; +∞ = l ⇔ lim |Un| n&#x2014;&gt; +∞ = |l|<br /></li>
<li>Un est une suite majoree et croissante ⇒ Un converge<br /></li>
<li>Un est une suite minoree et decroissante ⇒ Un converge<br /></li>
<li>Soient (Un) et (Vn) deux suites convergentes, alors<br />
<ol class="org-ol">
<li>Un + Vn est convergente<br /></li>
<li>Un * Vn est convergente<br /></li>
<li>∀λ ∈ ℝ , (λUn) converge<br /></li>
</ol></li>
<li>Soit Un est une suite bornee et soit Vn une suite. lim Vn n-&gt;+∞ = 0 Alors lim Vn * Un n-&gt; +∞ = 0<br /></li>
</ol>
</div>
</div>
</div>
<div id="outline-container-orga3baa03" class="outline-3">
<h3 id="orga3baa03">Theoreme d&rsquo;encadrement</h3>
<div class="outline-text-3" id="text-orga3baa03">
<p>
Soient Un Vn et Wn trois suites ∀n ∈ ℕ, Un ≤ Vn ≤ Wn . et lim Un n-&gt;∞ = lim Wn n-&gt; +∞  = l ⇒ lim Vn n-&gt; +∞ = l<br />
</p>
</div>
</div>
<div id="outline-container-orgbbda563" class="outline-3">
<h3 id="orgbbda563">Suites arithmetiques</h3>
<div class="outline-text-3" id="text-orgbbda563">
<p>
Un est une suite arithmetique si : U(n+1) = Un + r ; r etant la raison de la suite<br />
</p>
</div>
<div id="outline-container-orgb4756c6" class="outline-4">
<h4 id="orgb4756c6">Forme general</h4>
<div class="outline-text-4" id="text-orgb4756c6">
<p>
<b>Un = U0 + nr</b> ; <b>Un = Up + (n - p)r</b><br />
</p>
</div>
</div>
<div id="outline-container-orga6494e4" class="outline-4">
<h4 id="orga6494e4">Somme des n premiers termes</h4>
<div class="outline-text-4" id="text-orga6494e4">
<p>
Un est une suite arithmetique, Sn = [(U0 + Un)(n + 1)]/2<br />
</p>


<p>
Sn = (n, k = 0)ΣUk est une somme partielle et lim Sn n-&gt;+∞ = k≥0ΣUk est une serie<br />
</p>
</div>
</div>
</div>
<div id="outline-container-org10d88d9" class="outline-3">
<h3 id="org10d88d9">Suites géométriques</h3>
<div class="outline-text-3" id="text-org10d88d9">
</div>
<div id="outline-container-orgfe286ce" class="outline-4">
<h4 id="orgfe286ce">Forme general</h4>
<div class="outline-text-4" id="text-orgfe286ce">
<p>
<b>Un = U0 x r^n</b><br />
</p>
</div>
</div>
<div id="outline-container-orgaa6b262" class="outline-4">
<h4 id="orgaa6b262">Somme des n premiers termes</h4>
<div class="outline-text-4" id="text-orgaa6b262">
<p>
n ∈ ℕ\{1} Sn = U0 (1 - r^(n+1))/1-r<br />
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-orgeeb4832" class="outline-2">
<h2 id="orgeeb4832">5th cours (suite) : <i>Oct 12</i></h2>
<div class="outline-text-2" id="text-orgeeb4832">
</div>
<div id="outline-container-orge9160fd" class="outline-3">
<h3 id="orge9160fd">Suites adjacentes:</h3>
<div class="outline-text-3" id="text-orge9160fd">
<p>
Soient (Un) et (Vn) deux suites, elles sont adjacentes si:<br />
</p>
<ol class="org-ol">
<li>(Un) est croissante et (Vn) est décroissante<br /></li>
<li>Un ≤ Vn<br /></li>
<li>lim (Un - Vn) n-&gt;+∞ = 0<br /></li>
</ol>
</div>
</div>
<div id="outline-container-orgaedf3ea" class="outline-3">
<h3 id="orgaedf3ea">Suites extraites (sous-suites):</h3>
<div class="outline-text-3" id="text-orgaedf3ea">
<p>
Soit (Un) une suite: ;U: ℕ -&#x2014;&gt; ℝ ;   n -&#x2014;&gt; Un ;ϕ: ℕ -&#x2014;&gt; ℕ ;   n -&#x2014;&gt; ϕn ;(U(ϕ(n))) est appelée une sous suite de (Un) ou bien une suite extraite.<br />
</p>
</div>
<div id="outline-container-org586e8c4" class="outline-4">
<h4 id="org586e8c4">Remarques:</h4>
<div class="outline-text-4" id="text-org586e8c4">
<ol class="org-ol">
<li>Si (Un) converge ⇒ ∀ n ∈ ℕ , U(ϕ(n)) converge aussi.<br /></li>
<li>Mais le contraire n&rsquo;es pas toujours vrais.<br /></li>
<li>U(2n) et U(2n+1) convergent vers la même limite (l), alors Un aussi converge vers l<br /></li>
</ol>
</div>
</div>
</div>
<div id="outline-container-org1ce447c" class="outline-3">
<h3 id="org1ce447c">Suites de Cauchy:</h3>
<div class="outline-text-3" id="text-org1ce447c">
<p>
(Un) n ∈ ℕ est une suite de Cauchy Si ; ;∀ ε &gt; 0 , ∃ N ∈ ℕ ; ∀ n &gt; m &gt; N ; |Un - Um| &lt; ε<br />
</p>
</div>
<div id="outline-container-orgd06f7ae" class="outline-4">
<h4 id="orgd06f7ae">Remarque :</h4>
<div class="outline-text-4" id="text-orgd06f7ae">
<ol class="org-ol">
<li>Toute suite convergente est une suite de Cauchy et toute suite Cauchy est une suite convergente<br /></li>
</ol>
</div>
</div>
</div>
<div id="outline-container-org392a346" class="outline-3">
<h3 id="org392a346">Théorème de Bolzano Weirstrass:</h3>
<div class="outline-text-3" id="text-org392a346">
<p>
On peut extraire une sous suite convergente de toute suite bornée<br />
</p>
</div>
</div>
</div>
<div id="outline-container-org91a748f" class="outline-2">
<h2 id="org91a748f">Chapitre 3 : Les limites et la continuité <i>Nov 14</i></h2>
<div class="outline-text-2" id="text-org91a748f">
</div>
<div id="outline-container-orgde4196b" class="outline-3">
<h3 id="orgde4196b">Fonction réelle à variable réelle :</h3>
<div class="outline-text-3" id="text-orgde4196b">
<p>
Soit  f : I &#x2013;&gt; ℝ , I ⊂= ℝ<br />
         x &#x2013;&gt; f (x)<br />
</p>
</div>
<div id="outline-container-orgd68331d" class="outline-4">
<h4 id="orgd68331d">L&rsquo;ensemble de départ :</h4>
<div class="outline-text-4" id="text-orgd68331d">
<p>
L&rsquo;ensemble de définition (Df)<br />
</p>
</div>
<ul class="org-ul">
<li><a id="org5899912"></a>Propriétés:<br />
<div class="outline-text-5" id="text-org5899912">
<p>
Soit f et g deux fonctions :<br />
f : I &#x2013;&gt; ℝ<br />
    x &#x2013;&gt; f (x)<br />
</p>

<p>
g : I &#x2013;&gt; ℝ<br />
    x &#x2013;&gt; g(x)<br />
</p>
</div>
<ul class="org-ul">
<li><a id="orge1e9b5a"></a>1) f+g<br />
<div class="outline-text-6" id="text-orge1e9b5a">
<p>
(g+f): I &#x2013;&gt; ℝ<br />
       x &#x2013;&gt; (f+g)(x) = f (x) + g(x)<br />
</p>
</div>
</li>
<li><a id="org9580e4d"></a>2) λf<br />
<div class="outline-text-6" id="text-org9580e4d">
<p>
∀λ ∈ ℝ : λf : I &#x2013;&gt; ℝ<br />
              x &#x2013;&gt; (λf)(x) = λf (x)<br />
</p>
</div>
</li>
<li><a id="orgc657e9e"></a>3) f*g<br />
<div class="outline-text-6" id="text-orgc657e9e">
<p>
(f*g): I &#x2013;&gt; ℝ<br />
       x &#x2013;&gt; (f*g)(x) = f (x) x g(x)<br />
</p>
</div>
</li>
<li><a id="org8718fe3"></a>4) f/g<br />
<div class="outline-text-6" id="text-org8718fe3">
<p>
f/g :  I &#x2013;&gt; ℝ<br />
       x &#x2013;&gt; f (x)/g(x) , g(x) ≠ 0<br />
</p>
</div>
</li>
</ul>
</li>
</ul>
</div>
<div id="outline-container-org3151412" class="outline-4">
<h4 id="org3151412">Les Limites :</h4>
<div class="outline-text-4" id="text-org3151412">
<p>
f : I &#x2013;&gt; ℝ<br />
   x &#x2013;&gt; f (x)<br />
   x<sub>0</sub> ∈ I ; x<sub>0</sub> extrémité de l&rsquo;intervalle.<br />
</p>

<p>
Lim<sub>x &#x2013;&gt; x<sub>0</sub></sub> f (x) est a Limite de f (x) quand x tend vers x<sub>0</sub><br />
</p>
</div>
<ul class="org-ul">
<li><a id="org378d0db"></a>Lim<sub>x &#x2013;&gt; x<sub>0</sub></sub> f (x) = l<br />
<div class="outline-text-5" id="text-org378d0db">
<p>
=&gt; |x - x<sub>0</sub>| &lt; ẟ , |f (x) - l| &lt; ε<br />
</p>
</div>
</li>
</ul>
</div>
<div id="outline-container-org287d826" class="outline-4">
<h4 id="org287d826">La continuité :</h4>
<div class="outline-text-4" id="text-org287d826">
<p>
Soit f : I &#x2013;&gt; ℝ         I = Df<br />
        x &#x2013;&gt; f (x)      x<sub>0</sub> ∈ I<br />
f est continue en x<sub>0</sub> ⇔ Lim<sub>x &#x2013;&gt; x<sub>0</sub></sub> f (x) = f (x<sub>0</sub>)<br />
∀ε &gt; 0 , ∃ẟ &gt; 0 , |x - x<sub>0</sub>| &lt; ẟ ⇒ |f (x) - f (x<sub>0</sub>)| &lt; ε<br />
</p>
</div>
</div>
<div id="outline-container-orgc77ab14" class="outline-4">
<h4 id="orgc77ab14">Prolongement par continuité :</h4>
<div class="outline-text-4" id="text-orgc77ab14">
<p>
Soit f : I/ {x<sub>0</sub>} &#x2013;&gt; ℝ<br />
        x &#x2013;&gt; f (x)<br />
</p>

<p>
Si lim<sub>x &#x2013;&gt; x<sub>0</sub></sub> f (x) = l Alors f est prolongéable par continuité en x<sub>0</sub><br />
</p>

<p>
On défini :<br />
f~ = f (x) si x ≠ x<sub>0</sub><br />
ET<br />
l si x = x<sub>0</sub><br />
           f~ : I &#x2013;&gt; ℝ<br />
                x &#x2013;&gt; f (x)<br />
</p>
</div>
</div>
<div id="outline-container-org8edfe47" class="outline-4">
<h4 id="org8edfe47">Théorème des valeurs intermédiaires :</h4>
<div class="outline-text-4" id="text-org8edfe47">
<p>
f : [a,b] &#x2013;&gt; ℝ<br />
Si f est continue sur [a,b]<br />
Alors ∀y ∈ f ([a,b]) ⇒ ∃x ∈ [a,b] ; y = f (x)<br />
</p>

<ol class="org-ol">
<li>Si f est continue sur [a,b]<br /></li>
<li>Si f (a) * f (b) &lt; 0<br /></li>
</ol>
<p>
Donc ∃ c ∈ ]a,b[ , f (c) = 0<br />
</p>
</div>
</div>
<div id="outline-container-orgea41b1c" class="outline-4">
<h4 id="orgea41b1c">Fonction croissante :</h4>
<div class="outline-text-4" id="text-orgea41b1c">
<p>
f : I &#x2013;&gt; J<br />
    f est croissante si ∀ x<sub>1</sub>,x<sub>2</sub> ∈ I<br />
        x<sub>1</sub> &lt; x<sub>2</sub> ⇒ f (x<sub>1</sub>) ≤ f (x<sub>2</sub>)<br />
</p>

<p>
f est strictement croissante si ∀ x<sub>1</sub>,x<sub>2</sub> ∈ I<br />
    x<sub>1</sub> &lt; x<sub>2</sub> ⇒ f (x<sub>1</sub>) &lt; f (x<sub>2</sub>)<br />
</p>

<p>
Si f est croissante ou décroissante, alors elle est bornée.<br />
</p>
</div>
</div>
<div id="outline-container-orgd45a9b4" class="outline-4">
<h4 id="orgd45a9b4">Injection = Strictement monotonne :</h4>
<div class="outline-text-4" id="text-orgd45a9b4">
<p>
f : I &#x2013;&gt; J<br />
f est injective si ∀ x<sub>1</sub>,x<sub>2</sub> ∈ I , f (x<sub>1</sub>) = f (x<sub>2</sub>) ⇒ x<sub>1</sub> = x<sub>2</sub><br />
</p>
</div>
</div>
<div id="outline-container-org189c903" class="outline-4">
<h4 id="org189c903">Surjection = Continuité :</h4>
<div class="outline-text-4" id="text-org189c903">
<p>
f est surjective si ∀ y ∈ J, ∃ x ∈ I , y = f (x)<br />
</p>
</div>
</div>
<div id="outline-container-org07713a2" class="outline-4">
<h4 id="org07713a2">Bijection :</h4>
<div class="outline-text-4" id="text-org07713a2">
<p>
Si f est injective et surjective, alors f est bijective<br />
f est bijective donc elle admet une bijection réciproque<br />
</p>
</div>
</div>
<div id="outline-container-org7512d26" class="outline-4">
<h4 id="org7512d26">Théorème de bijection :</h4>
<div class="outline-text-4" id="text-org7512d26">
<p>
Si f est continue et strictement monotone alors elle est bijective.<br />
f admet une bijection réciproque f{-1}.<br />
f{-1} a le même sens de variation que f.<br />
</p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Crystal</p>
<p class="date">Created: 2023-11-14 Tue 23:06</p>
</div>
</body>
</html>